spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/creates_a_customer_with_a_valid_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=6&card[exp_year]=2019&card[cvc]=314
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.13.0
      Authorization:
      - Bearer sk_test_OwLn2xDcWLy5giDqk5b9Fq1k
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.13.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        myflix-104012 3.13.4 #1 SMP Mon Mar 3 09:07:22 UTC 2014 x86_64 x86_64 x86_64
        GNU/Linux"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 11 Jun 2014 04:56:39 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '570'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Stripe-Version:
      - '2014-05-19'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_104CSi4tb5cZffxRbT31IjzZ",
          "livemode": false,
          "created": 1402462599,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_104CSi4tb5cZffxRpgFDqYyH",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 6,
            "exp_year": 2019,
            "fingerprint": "VfkQZgiLeMQDObnc",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Wed, 11 Jun 2014 04:56:39 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_104CSi4tb5cZffxRbT31IjzZ&email=dallin_monahan%40dooley.org
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.13.0
      Authorization:
      - Bearer sk_test_OwLn2xDcWLy5giDqk5b9Fq1k
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.13.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        myflix-104012 3.13.4 #1 SMP Mon Mar 3 09:07:22 UTC 2014 x86_64 x86_64 x86_64
        GNU/Linux"}'
      Content-Length:
      - '67'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 11 Jun 2014 04:56:41 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1254'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-05-19'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1402462600,
          "id": "cus_4CSiy5Q8seSnr9",
          "livemode": false,
          "description": null,
          "email": "dallin_monahan@dooley.org",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_4CSiy5Q8seSnr9/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4CSiy5Q8seSnr9/cards",
            "data": [
              {
                "id": "card_104CSi4tb5cZffxRpgFDqYyH",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 6,
                "exp_year": 2019,
                "fingerprint": "VfkQZgiLeMQDObnc",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4CSiy5Q8seSnr9"
              }
            ]
          },
          "default_card": "card_104CSi4tb5cZffxRpgFDqYyH"
        }
    http_version: 
  recorded_at: Wed, 11 Jun 2014 04:56:41 GMT
recorded_with: VCR 2.9.2
